ChenjhReallin/mbed-os/targets/TARGET_GigaDevice/TARGET_GD32F4XX/serial_api.c
/* mbed Microcontroller Library
 * Copyright (c) 2018 GigaDevice Semiconductor Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
#include "mbed_assert.h"
#include "serial_api.h"

#if DEVICE_SERIAL

#include "cmsis.h"
#include "pinmap.h"
#include "mbed_error.h"
#include <string.h>
#include "PeripheralPins.h"

#define USART_NUM (8)

static uint32_t serial_irq_ids[USART_NUM]   = {0};
static rcu_periph_enum usart_clk[USART_NUM] = {RCU_USART0, RCU_USART1, RCU_USART2, RCU_UART3,
                                               RCU_UART4, RCU_USART5, RCU_UART6, RCU_UART7
                                              };
static IRQn_Type usart_irq_n[USART_NUM]     = {USART0_IRQn, USART1_IRQn, USART2_IRQn, UART3_IRQn,
                                               UART4_IRQn, USART5_IRQn, UART6_IRQn, UART7_IRQn
                                              };
#pragma reagion reallin_custom
#include "gd32f4xx_dma.h"
int serial_tx_asynch_dma(serial_t *obj, const void *tx, size_t tx_length, uint8_t tx_width, uint32_t handler, uint32_t event);
int serial_rx_asynch_dma(serial_t *obj, void *rx, size_t rx_length, uint8_t rx_width, uint32_t handler, uint32_t event, uint8_t char_match);
static void serial_dma_irq(uint32_t uart_periph, uint8_t index, serial_dma_dir dir);

static serial_dma_handle_t serial_dma_handles[USART_NUM] = {
    //USART0
    {
        .tx = {
            .init_struct = {0},
            .dma_periph = DMA1,
            .dma_rcu = RCU_DMA1,
            .dma_irq = DMA1_Channel7_IRQn,
            .dma_channel = DMA_CH7,
            .sub_periph = DMA_SUBPERI4,
        },
        .rx = {
            .init_struct = {0},
            .dma_periph = DMA1,
            .dma_rcu = RCU_DMA1,
            .dma_irq = DMA1_Channel5_IRQn,
            .dma_channel = DMA_CH5,
            .sub_periph = DMA_SUBPERI4,
        }
    },
    //USART1
    {
        .tx = {
            .init_struct = {0},
            .dma_periph = DMA0,
            .dma_rcu = RCU_DMA0,
            .dma_irq = DMA0_Channel6_IRQn,
            .dma_channel = DMA_CH6,
            .sub_periph = DMA_SUBPERI4,
        },
        .rx = {
            .init_struct = {0},
            .dma_periph = DMA0,
            .dma_rcu = RCU_DMA0,
            .dma_irq = DMA0_Channel5_IRQn,
            .dma_channel = DMA_CH5,
            .sub_periph = DMA_SUBPERI4,
        }
    },
    //USART2
    {
        .tx = {
            .init_struct = {0},
            .dma_periph = DMA0,
            .dma_rcu = RCU_DMA0,
            .dma_irq = DMA0_Channel3_IRQn,
            .dma_channel = DMA_CH3,
            .sub_periph = DMA_SUBPERI4,
        },
        .rx = {
            .init_struct = {0},
            .dma_periph = DMA0,
            .dma_rcu = RCU_DMA0,
            .dma_irq = DMA0_Channel1_IRQn,
            .dma_channel = DMA_CH1,
            .sub_periph = DMA_SUBPERI4,
        }
    },
    //UART3
    {
        .tx = {
            .init_struct = {0},
            .dma_periph = DMA0,
            .dma_rcu = RCU_DMA0,
            .dma_irq = DMA0_Channel4_IRQn,
            .dma_channel = DMA_CH4,
            .sub_periph = DMA_SUBPERI4,
        },
        .rx = {
            .init_struct = {0},
            .dma_periph = DMA0,
            .dma_rcu = RCU_DMA0,
            .dma_irq = DMA0_Channel2_IRQn,
            .dma_channel = DMA_CH2,
            .sub_periph = DMA_SUBPERI4,
        }
    },
    //UART4
    {
        .tx = {
            .init_struct = {0},
            .dma_periph = DMA0,
            .dma_rcu = RCU_DMA0,
            .dma_irq = DMA0_Channel7_IRQn,
            .dma_channel = DMA_CH7,
            .sub_periph = DMA_SUBPERI4,
        },
        .rx = {
            .init_struct = {0},
            .dma_periph = DMA0,
            .dma_rcu = RCU_DMA0,
            .dma_irq = DMA0_Channel0_IRQn,
            .dma_channel = DMA_CH0,
            .sub_periph = DMA_SUBPERI4,
        }
    },
    //USART5
    {
        .tx = {
            .init_struct = {0},
            .dma_periph = DMA1,
            .dma_rcu = RCU_DMA1,
            .dma_irq = DMA1_Channel6_IRQn,
            .dma_channel = DMA_CH6,
            .sub_periph = DMA_SUBPERI5,
        },
        .rx = {
            .init_struct = {0},
            .dma_periph = DMA1,
            .dma_rcu = RCU_DMA1,
            .dma_irq = DMA1_Channel1_IRQn,
            .dma_channel = DMA_CH1,
            .sub_periph = DMA_SUBPERI5,
        }
    },
    //UART6
    {
        .tx = { // Conflict with UART2 rx
            .init_struct = {0},
            .dma_periph = DMA0,
            .dma_rcu = RCU_DMA0,
            .dma_irq = DMA0_Channel1_IRQn,
            .dma_channel = DMA_CH1,
            .sub_periph = DMA_SUBPERI5,
        },
        .rx = { // Conflict with UART2 tx
            .init_struct = {0},
            .dma_periph = DMA0,
            .dma_rcu = RCU_DMA0,
            .dma_irq = DMA0_Channel3_IRQn,
            .dma_channel = DMA_CH3,
            .sub_periph = DMA_SUBPERI5,
        }
    },
    //UART7
    {
        .tx = { // Conflict with UART4 rx
            .init_struct = {0},
            .dma_periph = DMA0,
            .dma_rcu = RCU_DMA0,
            .dma_irq = DMA0_Channel0_IRQn,
            .dma_channel = DMA_CH0,
            .sub_periph = DMA_SUBPERI5,
        },
        .rx = { // Conflict with UART1 tx
            .init_struct = {0},
            .dma_periph = DMA0,
            .dma_rcu = RCU_DMA0,
            .dma_irq = DMA0_Channel6_IRQn,
            .dma_channel = DMA_CH6,
            .sub_periph = DMA_SUBPERI5,
        }
    },
};

void DMA0_Channel0_IRQHandler(void)
{
    serial_dma_irq(UART4, 4, serial_dma_rx);
    // serial_dma_irq(UART7, serial_dma_tx);
}

