ChenjhReallin/mbed-os/targets/TARGET_GigaDevice/TARGET_GD32F4XX/serial_api.c
void DMA0_Channel1_IRQHandler(void)
{
    serial_dma_irq(USART2, 2, serial_dma_rx);
    // serial_dma_irq(UART6, serial_dma_tx);
}

void DMA0_Channel2_IRQHandler(void)
{
    serial_dma_irq(UART3, 3, serial_dma_rx);
}

void DMA0_Channel3_IRQHandler(void)
{
    serial_dma_irq(USART2, 2, serial_dma_tx);
    // serial_dma_irq(UART6, serial_dma_rx);
}

void DMA0_Channel4_IRQHandler(void)
{
    serial_dma_irq(UART3, 3, serial_dma_tx);
}

void DMA0_Channel5_IRQHandler(void)
{
    serial_dma_irq(USART1, 1, serial_dma_rx);
}

void DMA0_Channel6_IRQHandler(void)
{
    serial_dma_irq(USART1, 1, serial_dma_tx);
    // serial_dma_irq(USART7, serial_dma_rx);
}

void DMA0_Channel7_IRQHandler(void)
{
    serial_dma_irq(UART4, 4, serial_dma_tx);
}

void DMA1_Channel1_IRQHandler(void)
{
    serial_dma_irq(USART5, 5, serial_dma_rx);
}

void DMA1_Channel5_IRQHandler(void)
{
    serial_dma_irq(USART0, 0, serial_dma_rx);
}

void DMA1_Channel6_IRQHandler(void)
{
    serial_dma_irq(USART5, 5, serial_dma_tx);
}

void DMA1_Channel7_IRQHandler(void)
{
    serial_dma_irq(USART0, 0, serial_dma_tx);
}

void serial_dma_irq(uint32_t uart_periph, uint8_t index, serial_dma_dir dir)
{
    dma_handle_t* dma_handle = (dma_handle_t*)(&serial_dma_handles[index]) + dir;
    uint32_t dma_periph = dma_handle->dma_periph;
    dma_channel_enum dma_channel = dma_handle->dma_channel;

    if(dma_interrupt_flag_get(dma_periph, dma_channel, DMA_INT_FLAG_FEE))
    {
        dma_interrupt_flag_clear(dma_periph, dma_channel, DMA_INT_FLAG_FEE);
    }
    if(dma_interrupt_flag_get(dma_periph, dma_channel, DMA_INT_FLAG_SDE))
    {
        dma_interrupt_flag_clear(dma_periph, dma_channel, DMA_INT_FLAG_SDE);
    }
    if(dma_interrupt_flag_get(dma_periph, dma_channel, DMA_INT_FLAG_TAE))
    {
        dma_interrupt_flag_clear(dma_periph, dma_channel, DMA_INT_FLAG_TAE);
    }
    if(dma_interrupt_flag_get(dma_periph, dma_channel, DMA_INT_FLAG_HTF))
    {
        dma_interrupt_flag_clear(dma_periph, dma_channel, DMA_INT_FLAG_HTF);
    }
    if(dma_interrupt_flag_get(dma_periph, dma_channel, DMA_INT_FLAG_FTF))
    {
        dma_interrupt_flag_clear(dma_periph, dma_channel, DMA_INT_FLAG_FTF);
        if(dir == serial_dma_tx)
        {
            if(dma_handle->init_struct.circular_mode == DMA_CIRCULAR_MODE_DISABLE)
            {
                dma_handle->init_struct.number = 0;
                usart_dma_transmit_config(uart_periph, USART_TRANSMIT_DMA_DISABLE);
                usart_interrupt_enable(uart_periph, USART_INT_TC);
            }
        }
        else // rx
        {
            if(dma_handle->init_struct.circular_mode == DMA_CIRCULAR_MODE_DISABLE)
            {
                dma_handle->init_struct.number = 0;
                usart_dma_receive_config(uart_periph, USART_RECEIVE_DMA_DISABLE);
            }
        }
    }
}
#pragma endreagion reallin_custom
static uart_irq_handler irq_handler;

int stdio_uart_inited = 0;
serial_t stdio_uart;

#if DEVICE_SERIAL_ASYNCH
#define GET_SERIAL_S(obj) (&((obj)->serial))
#else
#define GET_SERIAL_S(obj) (obj)
#endif /* DEVICE_SERIAL_ASYNCH */

/** Initialize the USART peripheral.
 *
 * @param obj_s The serial object
 */
static void usart_init(struct serial_s *obj_s)
{
    if (obj_s->index >= USART_NUM) {
        return;
    }

    /* USART configuration */
    usart_deinit(obj_s->uart);
    usart_word_length_set(obj_s->uart, obj_s->databits);
    usart_baudrate_set(obj_s->uart, obj_s->baudrate);
    usart_stop_bit_set(obj_s->uart, obj_s->stopbits);
    usart_parity_config(obj_s->uart, obj_s->parity);
#if DEVICE_SERIAL_FC
    if (obj_s->hw_flow_ctl == USART_HWCONTROL_NONE) {
        usart_hardware_flow_cts_config(obj_s->uart, USART_CTS_DISABLE);
        usart_hardware_flow_rts_config(obj_s->uart, USART_RTS_DISABLE);
    } else if (obj_s->hw_flow_ctl == USART_HWCONTROL_RTS) {
        usart_hardware_flow_cts_config(obj_s->uart, USART_CTS_DISABLE);
        usart_hardware_flow_rts_config(obj_s->uart, USART_RTS_ENABLE);
    } else if (obj_s->hw_flow_ctl == USART_HWCONTROL_CTS) {
        usart_hardware_flow_cts_config(obj_s->uart, USART_CTS_ENABLE);
        usart_hardware_flow_rts_config(obj_s->uart, USART_RTS_DISABLE);
    } else if (obj_s->hw_flow_ctl == USART_HWCONTROL_RTS_CTS) {
        usart_hardware_flow_cts_config(obj_s->uart, USART_CTS_ENABLE);
        usart_hardware_flow_rts_config(obj_s->uart, USART_RTS_ENABLE);
    }
#endif /* DEVICE_SERIAL_FC */
    usart_receive_config(obj_s->uart, USART_RECEIVE_ENABLE);
    usart_transmit_config(obj_s->uart, USART_TRANSMIT_ENABLE);
    usart_enable(obj_s->uart);
}

/** Initialize the serial peripheral. It sets the default parameters for serial
 *  peripheral, and configures its specifieds pins.
 *
 * @param obj The serial object
 * @param tx  The TX pin name
 * @param rx  The RX pin name
 */
void serial_init(serial_t *obj, PinName tx, PinName rx)
{
    struct serial_s *p_obj = GET_SERIAL_S(obj);

    UARTName uart_tx = (UARTName)pinmap_peripheral(tx, PinMap_UART_TX);
    UARTName uart_rx = (UARTName)pinmap_peripheral(rx, PinMap_UART_RX);

    p_obj->uart = (UARTName)pinmap_merge(uart_tx, uart_rx);
    MBED_ASSERT(p_obj->uart != (UARTName)NC);

    /* enable UART peripheral clock */
    if (p_obj->uart == UART_0) {
        p_obj->index = 0;
        rcu_periph_clock_enable(usart_clk[p_obj->index]);
    } else if (p_obj->uart == UART_1) {
        p_obj->index = 1;
        rcu_periph_clock_enable(usart_clk[p_obj->index]);
    } else if (p_obj->uart == UART_2) {
        p_obj->index = 2;
        rcu_periph_clock_enable(usart_clk[p_obj->index]);
    } else if (p_obj->uart == UART_3) {
        p_obj->index = 3;
        rcu_periph_clock_enable(usart_clk[p_obj->index]);
    } else if (p_obj->uart == UART_4) {
        p_obj->index = 4;
        rcu_periph_clock_enable(usart_clk[p_obj->index]);
    } else if (p_obj->uart == UART_5) {
        p_obj->index = 5;
        rcu_periph_clock_enable(usart_clk[p_obj->index]);
    } else if (p_obj->uart == UART_6) {
        p_obj->index = 6;
        rcu_periph_clock_enable(usart_clk[p_obj->index]);
    } else if (p_obj->uart == UART_7) {
        p_obj->index = 7;
        rcu_periph_clock_enable(usart_clk[p_obj->index]);
    }

#pragma reagion reallin_custom
    p_obj->dma_handle = &serial_dma_handles[p_obj->index];
#pragma endreagion reallin_custom

    /* configurte the pins */
    pinmap_pinout(tx, PinMap_UART_TX);
    pinmap_pinout(rx, PinMap_UART_RX);

    /* default UART parameters */
    p_obj->baudrate    = 9600U;
    p_obj->databits    = USART_WL_8BIT;
    p_obj->stopbits    = USART_STB_1BIT;
    p_obj->parity      = USART_PM_NONE;

#if DEVICE_SERIAL_FC
    p_obj->hw_flow_ctl = USART_HWCONTROL_NONE;
#endif /* DEVICE_SERIAL_FC */

    p_obj->pin_tx = tx;
    p_obj->pin_rx = rx;

    p_obj->tx_state = OP_STATE_BUSY;
    p_obj->rx_state = OP_STATE_BUSY;

    usart_init(p_obj);

    p_obj->tx_state = OP_STATE_READY;
    p_obj->rx_state = OP_STATE_READY;

    if (p_obj->uart == STDIO_UART) {
        stdio_uart_inited = 1;
        memcpy(&stdio_uart, obj, sizeof(serial_t));
    }
}

/** Release the serial peripheral, not currently invoked. It requires further
 *  resource management.
 *
 * @param obj The serial object
 */
void serial_free(serial_t *obj)
{
    struct serial_s *p_obj     = GET_SERIAL_S(obj);
    rcu_periph_enum rcu_periph = usart_clk[p_obj->index];

    /* reset USART and disable clock */
    usart_deinit(p_obj->uart);
    rcu_periph_clock_disable(rcu_periph);

    serial_irq_ids[p_obj->index] = 0;

