ChenjhReallin/mbed-os/targets/TARGET_GigaDevice/TARGET_GD32F4XX/serial_api.c
    if (serial_rx_active(obj)) {
        /* some reception is in progress */
        return;
    }

#pragma region reallin_custom
    p_obj->rx_hint = hint;
    if(hint != DMA_USAGE_NEVER)
    {
        serial_rx_asynch_dma(obj, rx, rx_length, rx_width, handler, event, char_match);
        return;
    }
#pragma endregion reallin_custom

    /* disable all events first */
    serial_event_disable(obj, SERIAL_EVENT_RX_ALL);
    /* enable the specific event */
    serial_event_enable(obj, event);

    obj->char_match = char_match;

    obj->rx_buff.buffer = rx;
    obj->rx_buff.length = rx_length;
    obj->rx_buff.pos = 0;

    /* enable interrupt */
    /* clear pending IRQ */
    NVIC_ClearPendingIRQ(irq);
    /* disable the IRQ first */
    NVIC_DisableIRQ(irq);
    /* set the priority(higher than Tx) and vector */
    NVIC_SetPriority(irq, 0);
    NVIC_SetVector(irq, (uint32_t)handler);
    /* enable IRQ */
    NVIC_EnableIRQ(irq);

    usart_rx_interrupt_preprocess(p_obj, (uint8_t *)rx, rx_length);
}

/** Attempts to determine if the serial peripheral is already in use for TX
 *
 * @param obj The serial object
 * @return Non-zero if the RX transaction is ongoing, 0 otherwise
 */
uint8_t serial_tx_active(serial_t *obj)
{
    struct serial_s *p_obj = GET_SERIAL_S(obj);

    return ((p_obj->tx_state == OP_STATE_BUSY_TX) ? 1 : 0);
}

/** Attempts to determine if the serial peripheral is already in use for RX
 *
 * @param obj The serial object
 * @return Non-zero if the RX transaction is ongoing, 0 otherwise
 */
uint8_t serial_rx_active(serial_t *obj)
{
    struct serial_s *p_obj = GET_SERIAL_S(obj);

    return ((p_obj->rx_state == OP_STATE_BUSY_RX) ? 1 : 0);
}

/** Handle the serial rx interrupt
 *
 * @param obj_s The serial object
 * @return Returns the status
 */
static gd_status_enum usart_rx_interrupt(struct serial_s *obj_s)
{
    uint16_t *temp;

    if (obj_s->rx_state == OP_STATE_BUSY_RX) {
        if (obj_s->databits == USART_WL_9BIT) {
            temp = (uint16_t *) obj_s->rx_buffer_ptr;
            if (obj_s->parity == USART_PM_NONE) {
                /* 9-bit data, none parity bit */
                *temp = (uint16_t)(USART_DATA(obj_s->uart) & (uint16_t)0x01FF);
                obj_s->rx_buffer_ptr += 2U;
            } else {
                /* 9-bit data, with parity bit */
                *temp = (uint16_t)(USART_DATA(obj_s->uart) & (uint16_t)0x00FF);
                obj_s->rx_buffer_ptr += 1U;
            }
        } else {
            if (obj_s->parity == USART_PM_NONE) {
                /* 8-bit data, none parity bit */
                *obj_s->rx_buffer_ptr++ = (uint8_t)(USART_DATA(obj_s->uart) & (uint8_t)0x00FF);
            } else {
                /* 8-bit data, with parity bit */
                *obj_s->rx_buffer_ptr++ = (uint8_t)(USART_DATA(obj_s->uart) & (uint8_t)0x007F);
            }
        }

        if (--obj_s->rx_count == 0U) {
            usart_interrupt_disable(obj_s->uart, USART_INT_RBNE);
            usart_interrupt_disable(obj_s->uart, USART_INT_PERR);
            usart_interrupt_disable(obj_s->uart, USART_INT_ERR);

            obj_s->rx_state = OP_STATE_READY;
        }

        return GD_OK;
    } else {
        return GD_BUSY;
    }
}

/** Handle the serial tx interrupt
 *
 * @param obj_s The serial object
 * @return Returns the status
 */
static gd_status_enum usart_tx_interrupt(struct serial_s *obj_s)
{
    uint16_t *temp;

    if (obj_s->tx_state == OP_STATE_BUSY_TX) {
        if (obj_s->databits == USART_WL_9BIT) {
            temp = (uint16_t *) obj_s->tx_buffer_ptr;
            USART_DATA(obj_s->uart) = (uint16_t)(*temp & (uint16_t)0x01FF);
            if (obj_s->parity == USART_PM_NONE) {
                obj_s->tx_buffer_ptr += 2U;
            } else {
                obj_s->tx_buffer_ptr += 1U;
            }
        } else {
            USART_DATA(obj_s->uart) = (uint8_t)(*obj_s->tx_buffer_ptr++ & (uint8_t)0x00FF);
        }

        if (--obj_s->tx_count == 0U) {
            /* disable USART_INT_TBE interrupt */
            usart_interrupt_disable(obj_s->uart, USART_INT_TBE);

            /* enable USART_INT_TC interrupt */
            usart_interrupt_enable(obj_s->uart, USART_INT_TC);
        }

        return GD_OK;
    } else {
        return GD_BUSY;
    }
}

/** Handle the serial tx complete interrupt
 *
 * @param obj_s The serial object
 */
void usart_tx_complete_interrupt(struct serial_s *obj_s)
{
    usart_interrupt_disable(obj_s->uart, USART_INT_TC);

    obj_s->tx_state = OP_STATE_READY;
}

/** Handle all the serial interrupt request
 *
 * @param obj_s The serial object
 */
void usart_irq_handler(struct serial_s *obj_s)
{
    uint32_t err_flags = 0U;

    /* no error occurs */
    err_flags = (USART_STAT0(obj_s->uart) & (uint32_t)(USART_FLAG_PERR | USART_FLAG_FERR | USART_FLAG_ORERR | USART_FLAG_NERR));
    if (err_flags == RESET) {
        /* check whether USART is in receiver mode or not */
        if (usart_interrupt_flag_get(obj_s->uart, USART_INT_FLAG_RBNE) != RESET) {
            usart_rx_interrupt(obj_s);

            return;
        }
    }

    /* some errors occur */
    if ((err_flags != RESET) &&
            (((USART_CTL2(obj_s->uart) & USART_INT_ERR) != RESET) ||
             ((USART_CTL0(obj_s->uart) & (USART_INT_RBNE | USART_INT_PERR)) != RESET))) {

        if (usart_interrupt_flag_get(obj_s->uart, USART_INT_FLAG_PERR) != RESET) {
            obj_s->error_code |= USART_ERROR_CODE_PERR;
        }

        if (usart_interrupt_flag_get(obj_s->uart, USART_INT_FLAG_ERR_NERR) != RESET) {
            obj_s->error_code |= USART_ERROR_CODE_NERR;
        }

        if (usart_interrupt_flag_get(obj_s->uart, USART_INT_FLAG_ERR_FERR) != RESET) {
            obj_s->error_code |= USART_ERROR_CODE_FERR;
        }

        if (usart_interrupt_flag_get(obj_s->uart, USART_INT_FLAG_ERR_ORERR) != RESET) {
            obj_s->error_code |= USART_ERROR_CODE_ORERR;
        }

        if (obj_s->error_code != USART_ERROR_CODE_NONE) {
            if (usart_interrupt_flag_get(obj_s->uart, USART_INT_FLAG_RBNE) != RESET) {
                usart_rx_interrupt(obj_s);
            }
#pragma reagion reallin_custom
            if((obj_s->rx_hint != DMA_USAGE_NEVER) || (obj_s->error_code & USART_ERROR_CODE_ORERR))
            {
                usart_interrupt_disable(obj_s->uart, USART_INT_RBNE);
                usart_interrupt_disable(obj_s->uart, USART_INT_PERR);
                usart_interrupt_disable(obj_s->uart, USART_INT_ERR);
                usart_interrupt_disable(obj_s->uart, USART_INT_IDLE);
                usart_dma_receive_config(obj_s->uart, USART_RECEIVE_DMA_DISABLE);
                obj_s->rx_state = OP_STATE_READY;
            }
#pragma endreagion reallin_custom
        }

        return;
    }

#pragma reagion reallin_custom
    if (usart_interrupt_flag_get(obj_s->uart, USART_INT_FLAG_IDLE) != RESET)
    {
        usart_interrupt_flag_clear(obj_s->uart, USART_INT_FLAG_IDLE);
        if((USART_CTL0(obj_s->uart) & USART_RECEIVE_ENABLE) == USART_RECEIVE_ENABLE)
        {
            dma_handle_t *dma_handle = &obj_s->dma_handle->rx;
            uint16_t remaining_rx_size = (uint16_t)dma_transfer_number_get(dma_handle->dma_periph, dma_handle->dma_channel);
            if((remaining_rx_size > 0) && (remaining_rx_size < obj_s->rx_size))
            {
                obj_s->rx_count = remaining_rx_size;

                if(dma_handle->init_struct.circular_mode != DMA_CIRCULAR_MODE_ENABLE)
                {
                    usart_interrupt_disable(obj_s->uart, USART_INT_PERR);
                    usart_interrupt_disable(obj_s->uart, USART_INT_ERR);
                    usart_interrupt_disable(obj_s->uart, USART_INT_IDLE);
                    usart_dma_receive_config(obj_s->uart, USART_RECEIVE_DMA_DISABLE);
                    dma_interrupt_disable(dma_handle->dma_periph, dma_handle->dma_channel, DMA_CHXFCTL_FEEIE);
                    dma_interrupt_disable(dma_handle->dma_periph, dma_handle->dma_channel, DMA_CHXCTL_SDEIE | DMA_CHXCTL_TAEIE | DMA_CHXCTL_HTFIE | DMA_CHXCTL_FTFIE);
                    dma_channel_disable(dma_handle->dma_periph, dma_handle->dma_channel);
                    obj_s->rx_state = OP_STATE_READY;
                }
            }
        }
        else
        {
            uint16_t rx_data = obj_s->rx_size - obj_s->rx_count;
            if((rx_data > 0) && (rx_data < obj_s->rx_size))
            {
                usart_interrupt_disable(obj_s->uart, USART_INT_RBNE);
                usart_interrupt_disable(obj_s->uart, USART_INT_PERR);
                usart_interrupt_disable(obj_s->uart, USART_INT_ERR);
                usart_interrupt_disable(obj_s->uart, USART_INT_IDLE);
                usart_dma_receive_config(obj_s->uart, USART_RECEIVE_DMA_DISABLE);
                obj_s->rx_state = OP_STATE_READY;
            }
        }
    }
#pragma endreagion reallin_custom

