ChenjhReallin/mbed-os/targets/TARGET_GigaDevice/TARGET_GD32F4XX/serial_api.c
    /* disable USART to modify CTS/RTS configuration */
    usart_disable(p_obj->uart);

    if (type == FlowControlNone) {
        p_obj->hw_flow_ctl = USART_HWCONTROL_NONE;
        usart_hardware_flow_cts_config(p_obj->uart, USART_CTS_DISABLE);
        usart_hardware_flow_rts_config(p_obj->uart, USART_RTS_DISABLE);
    }

    if (type == FlowControlRTS) {
        MBED_ASSERT(uart_rts != (UARTName)NC);
        p_obj->hw_flow_ctl = USART_HWCONTROL_RTS;
        p_obj->pin_rts = rxflow;
        pinmap_pinout(rxflow, PinMap_UART_RTS);
        usart_hardware_flow_cts_config(p_obj->uart, USART_CTS_DISABLE);
        usart_hardware_flow_rts_config(p_obj->uart, USART_RTS_ENABLE);
    }

    if (type == FlowControlCTS) {
        MBED_ASSERT(uart_cts != (UARTName)NC);
        p_obj->hw_flow_ctl = USART_HWCONTROL_CTS;
        p_obj->pin_cts = txflow;
        pinmap_pinout(txflow, PinMap_UART_CTS);
        usart_hardware_flow_rts_config(p_obj->uart, USART_RTS_DISABLE);
        usart_hardware_flow_cts_config(p_obj->uart, USART_CTS_ENABLE);
    }

    if (type == FlowControlRTSCTS) {
        MBED_ASSERT(uart_rts != (UARTName)NC);
        MBED_ASSERT(uart_cts != (UARTName)NC);
        p_obj->hw_flow_ctl = USART_HWCONTROL_RTS_CTS;
        p_obj->pin_rts = rxflow;
        p_obj->pin_cts = txflow;
        pinmap_pinout(txflow, PinMap_UART_CTS);
        pinmap_pinout(rxflow, PinMap_UART_RTS);
        usart_hardware_flow_cts_config(p_obj->uart, USART_CTS_ENABLE);
        usart_hardware_flow_rts_config(p_obj->uart, USART_RTS_ENABLE);
    }

    /* restore the UEN flag */
    if (RESET != uen_flag) {
        usart_enable(p_obj->uart);
    }
}

#endif /* DEVICE_SERIAL_FC */

#if DEVICE_SLEEP
/** Check whether the serial is in busy state
 *
 * @return 0: all the serial is free to use, 1: some serial is in busy in transfer
 */
int serial_busy_state_check(void)
{
#if defined(USART0)
    if ((USART_CTL0(USART0) & USART_CTL0_UEN) && !(USART_STAT0(USART0) & USART_STAT0_TC)) {
        return 1;
    }
#endif

#if defined(USART1)
    if ((USART_CTL0(USART1) & USART_CTL0_UEN) && !(USART_STAT0(USART1) & USART_STAT0_TC)) {
        return 1;
    }
#endif

#if defined(USART2)
    if ((USART_CTL0(USART2) & USART_CTL0_UEN) && !(USART_STAT0(USART2) & USART_STAT0_TC)) {
        return 1;
    }
#endif

#if defined(UART3)
    if ((USART_CTL0(UART3) & USART_CTL0_UEN) && !(USART_STAT0(UART3) & USART_STAT0_TC)) {
        return 1;
    }
#endif

#if defined(UART4)
    if ((USART_CTL0(UART4) & USART_CTL0_UEN) && !(USART_STAT0(UART4) & USART_STAT0_TC)) {
        return 1;
    }
#endif

#if defined(USART5)
    if ((USART_CTL0(USART5) & USART_CTL0_UEN) && !(USART_STAT0(USART5) & USART_STAT0_TC)) {
        return 1;
    }
#endif

#if defined(UART6)
    if ((USART_CTL0(UART6) & USART_CTL0_UEN) && !(USART_STAT0(UART6) & USART_STAT0_TC)) {
        return 1;
    }
#endif

#if defined(UART7)
    if ((USART_CTL0(UART7) & USART_CTL0_UEN) && !(USART_STAT0(UART7) & USART_STAT0_TC)) {
        return 1;
    }
#endif

    /* no serial is in busy state */
    return 0;
}
#endif /* DEVICE_SLEEP */

#pragma region reallin_custom
uint32_t serial_rx_buffer_size_get(serial_t *obj)
{
    struct serial_s *p_obj = GET_SERIAL_S(obj);

    if(p_obj->rx_hint != DMA_USAGE_NEVER)
    {
		return obj->rx_buff.length - dma_transfer_number_get(p_obj->dma_handle->rx.dma_periph, p_obj->dma_handle->rx.dma_channel);
    }
    else
    {
	    return obj->rx_buff.pos;
    }
}

/**
 * Begin asynchronous DMA TX transfer. The used buffer is specified in the serial
 * object, tx_buff
 *
 * @param obj       The serial object
 * @param tx        The buffer for sending
 * @param tx_length The number of words to transmit
 * @param tx_width  The bit width of buffer word
 * @param handler   The serial handler
 * @param event     The logical OR of events to be registered
 * @return Returns number of data transfered, or 0 otherwise
 */
int serial_tx_asynch_dma(serial_t *obj, const void *tx, size_t tx_length, uint8_t tx_width, uint32_t handler, uint32_t event)
{
	struct serial_s *obj_s = GET_SERIAL_S(obj);
    dma_handle_t* dma_handle = &obj_s->dma_handle->tx;
    
    if((dma_handle->dma_periph != DMA0) && (dma_handle->dma_periph != DMA1))
    {
        return GD_ERROR;
    }
    
    if (obj_s->tx_state == OP_STATE_READY) {
        if ((tx == NULL) || (tx_length == 0U)) {
            return GD_ERROR;
        }
    } else {
        return GD_BUSY;
    }

    rcu_periph_clock_enable(dma_handle->dma_rcu);
    memset(&dma_handle->init_struct, 0, sizeof(dma_single_data_parameter_struct));
    dma_handle->init_struct.periph_addr = (uint32_t)&USART_DATA(obj_s->uart);
    dma_handle->init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
    dma_handle->init_struct.memory0_addr = (uint32_t)tx;
    dma_handle->init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    dma_handle->init_struct.periph_memory_width = DMA_PERIPH_WIDTH_8BIT;
    dma_handle->init_struct.circular_mode = DMA_CIRCULAR_MODE_DISABLE;
    dma_handle->init_struct.direction = DMA_MEMORY_TO_PERIPH;
    dma_handle->init_struct.number = tx_length;
    dma_handle->init_struct.priority = DMA_PRIORITY_ULTRA_HIGH;

    dma_deinit(dma_handle->dma_periph, dma_handle->dma_channel);
    dma_channel_subperipheral_select(dma_handle->dma_periph, dma_handle->dma_channel, dma_handle->sub_periph);
    dma_single_data_mode_init(dma_handle->dma_periph, dma_handle->dma_channel, &dma_handle->init_struct);
    
    obj->tx_buff.buffer = (void *)tx;
    obj->tx_buff.length = tx_length;
    obj->tx_buff.pos = 0;

    /* disable all events first */
    serial_event_disable(obj, SERIAL_EVENT_TX_ALL);
    /* enable the specific event */
    serial_event_enable(obj, event);


    obj_s->tx_buffer_ptr = (uint8_t *)tx;
    obj_s->tx_count = tx_length;
    obj_s->error_code = USART_ERROR_CODE_NONE;
    obj_s->tx_state = OP_STATE_BUSY_TX;
    
    usart_interrupt_flag_clear(obj_s->uart, USART_INT_FLAG_TC);
    dma_interrupt_enable(dma_handle->dma_periph, dma_handle->dma_channel, DMA_CHXCTL_SDEIE | DMA_CHXCTL_TAEIE | DMA_CHXCTL_FTFIE);
    dma_channel_enable(dma_handle->dma_periph, dma_handle->dma_channel);

    usart_dma_transmit_config(obj_s->uart, USART_TRANSMIT_DMA_ENABLE);

