ChenjhReallin/mbed-os/targets/TARGET_GigaDevice/TARGET_GD32F4XX/serial_api.c
    // Enable DMA interrupt
    NVIC_ClearPendingIRQ(dma_handle->dma_irq);
    NVIC_DisableIRQ(dma_handle->dma_irq);
    NVIC_SetPriority(dma_handle->dma_irq, 1);
    NVIC_EnableIRQ(dma_handle->dma_irq);
    
    // Enable UART interrupt
	{
        IRQn_Type irq_n = usart_irq_n[obj_s->index];
		NVIC_ClearPendingIRQ(irq_n);
		NVIC_DisableIRQ(irq_n);
		NVIC_SetPriority(irq_n, 1);
		NVIC_SetVector(irq_n, (uint32_t)handler);
		NVIC_EnableIRQ(irq_n);
	}
    
    return GD_OK;
}

/**
 * Begin asynchronous DMA RX transfer (enable interrupt for data collecting)
 * The used buffer is specified in the serial object, rx_buff
 *
 * @param obj        The serial object
 * @param rx         The buffer for sending
 * @param rx_length  The number of words to transmit
 * @param rx_width   The bit width of buffer word
 * @param handler    The serial handler
 * @param event      The logical OR of events to be registered
 * @param handler    The serial handler
 * @param char_match A character in range 0-254 to be matched
 */
int serial_rx_asynch_dma(serial_t *obj, void *rx, size_t rx_length, uint8_t rx_width, uint32_t handler, uint32_t event, uint8_t char_match)
{
	struct serial_s *obj_s = GET_SERIAL_S(obj);
    dma_handle_t* dma_handle = &obj_s->dma_handle->rx;

    if((dma_handle->dma_periph != DMA0) && (dma_handle->dma_periph != DMA1))
    {
        return GD_ERROR;
    }
    
    if (obj_s->rx_state == OP_STATE_READY) {
        if ((rx == NULL) || (rx_length == 0U)) {
            return GD_ERROR;
        }
    } else {
        return GD_BUSY;
    }

    rcu_periph_clock_enable(dma_handle->dma_rcu);
    memset(&dma_handle->init_struct, 0, sizeof(dma_single_data_parameter_struct));
    dma_handle->init_struct.periph_addr = (uint32_t)&USART_DATA(obj_s->uart);
    dma_handle->init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
    dma_handle->init_struct.memory0_addr = (uint32_t)rx;
    dma_handle->init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    dma_handle->init_struct.periph_memory_width = DMA_PERIPH_WIDTH_8BIT;
    dma_handle->init_struct.circular_mode = DMA_CIRCULAR_MODE_DISABLE;
    dma_handle->init_struct.direction = DMA_PERIPH_TO_MEMORY;
    dma_handle->init_struct.number = rx_length;
    dma_handle->init_struct.priority = DMA_PRIORITY_ULTRA_HIGH;

    dma_deinit(dma_handle->dma_periph, dma_handle->dma_channel);
    dma_channel_subperipheral_select(dma_handle->dma_periph, dma_handle->dma_channel, dma_handle->sub_periph);
    dma_single_data_mode_init(dma_handle->dma_periph, dma_handle->dma_channel, &dma_handle->init_struct);

	//Set up events
	serial_event_disable(obj, SERIAL_EVENT_RX_ALL);     // Clear alle events
	serial_event_enable(obj, event);                    // Set only the wanted events

	// set CharMatch
	obj->char_match = char_match;

    obj->rx_buff.buffer = rx;
    obj->rx_buff.length = rx_length;
    obj->rx_buff.pos = 0;

    obj_s->rx_buffer_ptr = (uint8_t*)rx;
    obj_s->rx_size       = rx_length;
    obj_s->rx_count      = rx_length;
    obj_s->error_code    = USART_ERROR_CODE_NONE;
    obj_s->rx_state      = OP_STATE_BUSY_RX;

    dma_interrupt_enable(dma_handle->dma_periph, dma_handle->dma_channel, DMA_CHXCTL_SDEIE | DMA_CHXCTL_TAEIE | DMA_CHXCTL_FTFIE);
    dma_channel_enable(dma_handle->dma_periph, dma_handle->dma_channel);
    usart_interrupt_enable(obj_s->uart, USART_INT_PERR);    
    usart_interrupt_enable(obj_s->uart, USART_INT_ERR);
    usart_interrupt_enable(obj_s->uart, USART_INT_IDLE);
    usart_dma_receive_config(obj_s->uart, USART_RECEIVE_DMA_ENABLE);

    // Enable DMA interrupt
    NVIC_ClearPendingIRQ(dma_handle->dma_irq);
    NVIC_DisableIRQ(dma_handle->dma_irq);
    NVIC_SetPriority(dma_handle->dma_irq, 1);
    NVIC_EnableIRQ(dma_handle->dma_irq);
    
    // Enable UART interrupt
	{
        IRQn_Type irq_n = usart_irq_n[obj_s->index];
		NVIC_ClearPendingIRQ(irq_n);
		NVIC_DisableIRQ(irq_n);
		NVIC_SetPriority(irq_n, 1);
		NVIC_SetVector(irq_n, (uint32_t)handler);
		NVIC_EnableIRQ(irq_n);
	}
    return GD_OK;
}
#pragma endregion reallin_custom

#endif /* DEVICE_SERIAL */
